#у матриці 4*4, що задана користувачем замініть всі від’ємні елементи на 0.
#щоб ви не мучились і не вводили багато чисел, так як матриця 4*4, я викликала рандом, але якщо потрібно я можу замінити,щоб вводив користувач
import random
import numpy
a = 4
b = 4
# Створюємо двовимірний масив розміром a*b
c = numpy.zeros ((a, b), dtype = numpy.int_)
for d in range(4):
    for e in range(4):
        c[d,e]=random.randint(-10,10)
for l in range (a):
    for o in range (b):
       #якщо рандом видасть від'ємні числа то те число заміниться на 0
        if c [l, o] <0:
            c [l, o] = 0#
# Виводимо результат обчислень на екран
print ( 'Кінечна матриця:  \n', c)